---
kind: enumMember
id: F:Autodesk.Revit.DB.LightAndMaterialAccuracyMode.Advanced
enum: Autodesk.Revit.DB.LightAndMaterialAccuracyMode
source: html/47b82b85-fc31-5228-b679-73b7da543487.htm
---
# Autodesk.Revit.DB.LightAndMaterialAccuracyMode.Advanced

Soft shadows and soft reflections from semi-rough materials will be rendered with a high quality level. This is the
 standard setting that you typically want to rely on for final high quality renderings.